Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [26]:
import pandas as pd

In [27]:
data = pd.Series([4, 8, 15, 16, 23,42])

In [28]:
data

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [13]:
var = ["Aman",22,"sahil",23,'eng','maths','pussy','camel','cock','mangos']

In [14]:
pd.Series(var)

0      Aman
1        22
2     sahil
3        23
4       eng
5     maths
6     pussy
7     camel
8      cock
9    mangos
dtype: object

Ques3 Create pandas data frame the contain the following data

In [15]:
#solution
df = pd.DataFrame({"Name":['Alice','Bob','Claire'] ,"Age":[25,30,27],"Gender":['Female','Male','Female']})

In [16]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

#solution 
Series: A Series is a one-dimensional labeled array, similar to a single column in a spreadsheet or a database table. It holds data of any type (integers, strings, floats, etc.) with an associated index for efficient retrieval and manipulation. Think of it as a list with labels.

DataFrame: A DataFrame, on the other hand, is a two-dimensional labeled data structure with columns and rows, much like a spreadsheet or a relational database table. Each column in a DataFrame is itself a Series. DataFrames can hold different data types in each column, providing a flexible way to store and organize tabular data.

In [17]:
#example of series
import pandas as pd

students = ["Sahil Amir","Smarty_Aman","nepali","Moauga"]

maths_grade = pd.Series([10,100,50,62],index = students)
eng_grade = pd.Series([100,10,50,85],index = students)
science_grade = pd.Series([55,45,65,32],index = students)

In [18]:
pd.Series(students)

0     Sahil Amir
1    Smarty_Aman
2         nepali
3         Moauga
dtype: object

In [19]:
#examples of data frame
df_grades = pd.DataFrame({'maths':maths_grade,'english':eng_grade,'science':science_grade})

In [20]:
df_grades

             maths  english  science
Sahil Amir      10      100       55
Smarty_Aman    100       10       45
nepali          50       50       65
Moauga          62       85       32

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

#solution
Pandas provides a wide range of functions for data manipulation in DataFrame objects. Some common functions include:
loc[] and iloc[]: Used for selecting rows and columns by label (loc[]) or by integer position (iloc[]).

sort_values():- Sort Dataframe by the specified column.

head():- It is used to display the first rows .By default it display 5 rows if not specified.

tail():- It is used to display the last rows. By default it display last 5 rows if not specified

In [21]:
#example of using loc() 
import pandas as pd

data  = {'Name':['Aman','chaman','shalu','lalu'],'Age':[22,25,12,62]}

df = pd.DataFrame(data)


df.loc[df['Age']>20]

     Name  Age
0    Aman   22
1  chaman   25
3    lalu   62

In [22]:
#example of sort_values()
df_sorted = df.sort_values(by = 'Age')

In [23]:
df_sorted

     Name  Age
2   shalu   12
0    Aman   22
1  chaman   25
3    lalu   62

In [24]:
#example of head()
df.head(2)

     Name  Age
0    Aman   22
1  chaman   25

In [25]:
#example of tail()
df.tail(3)

     Name  Age
1  chaman   25
2   shalu   12
3    lalu   62